app/controllers/posts_controller.rb

SELECT * FROM "posts" LIMIT 1 OFFSET 0
SELECT count(*) AS count_all FROM "posts"
---
  def index
    @page = params[:page] || 1
    @posts = Post.paginate(:all, :page => @page, :per_page => 10)

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def show
    @post = Post.find(params[:id])

INSERT INTO "posts" ("updated_at", "title", "body", "posted_at", "created_at") VALUES('2009-07-20 20:21:41', 'Test', 'This is a test of a post body', '2009-07-20 20:21:00', '2009-07-20 20:21:41')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save